app/controllers/books_controller.rb

	def show
		@book=Book.find(params[:id])
---
SELECT * FROM "books" WHERE ("books"."id" = 1)

	def create
		@book = Book.new(params[:book])
		if @book.save
---
INSERT INTO "books" ("title", "description", "created_at", "price", "subject_id") VALUES('Psy', 'Psychology book for every one', '2014-02-04 16:56:56', 12.0, 4)

	def edit
		@books =Book.find(:all)
---
SELECT * FROM "books" WHERE ("books"."id" = 1)

	def update
		@book =Book.find(params[:id])
		if @book.update_attributes(params[:book])
---
SELECT * FROM "books" WHERE ("books"."id" = 1)
UPDATE "books" SET "description" = 'sdfsdfsdfsdf' WHERE "id" = 1

	def show_subjects
		@subject =Subject.find(params[:id])
---
SELECT * FROM "subjects" WHERE ("subjects"."id" = 1)