app/controllers/books_controller.rb

	def index
		@list_books=Books.all
---
SELECT * FROM "books"